bineea/naobot/firmware/esp32/build/XIAO_ESP32S3_SENSE/mpconfigboard.h
#define MICROPY_HW_MCU_NAME "ESP32S3"

#define MICROPY_HW_I2C0_SDA (5)
#define MICROPY_HW_I2C0_SCL (6)
